## Add Homebrew tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "github/gh"

## Install Packages
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# CLI utility for displaying current network utilization
brew "bandwhich"

# Greps through binaries from various OSs and architectures
brew "bingrep"

# A cross-platform graphical process/system monitor aka. btm
brew "bottom"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Unclutter your .profile
brew "direnv"

# CLI DNS client, like dig
brew "dog"

# du + rust = dust, like du but more intuitive
brew "dust"

# Modern replacement for 'ls'
brew "exa"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Play, record, convert, and stream audio and video
brew "ffmpeg"

# Facebook PathPicker
brew "fpp"

# A command-line fuzzy finder
brew "fzf"

# A nonsense activity generator
brew "genact"

# A syntax-highlighting pager for git, diff, and grep output
brew "git-delta"

# GnuPG
brew "gnupg"

# User-friendly command-line HTTP client
brew "httpie"

# Display bandwidth usage on an interface
brew "iftop"

# SSL/TLS cryptography library
brew "openssl"

# Infamous electronic fortune-cookie generator
brew "fortune"

# GitHub official CLI
brew "gh"

# The Go Programing Language
brew "go"

# Remote repository management made easy
brew "ghq"

# Distributed revision control system
brew "git"

# Git extension for versioning large files
brew "git-lfs"

# Bash-tool to store the private data inside Git
brew "git-secret"

# Prevents you from committing sensitive information to Git
brew "git-secrets"

# Refgular Expression generator
brew "grex"

# Simple hex viewer
brew "hexyl"

# Convert source code to formatted text with syntax highlighting
brew "highlight"

# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# Lightweight and flexible CLI JSON processor
brew "jq"

# The fastest polyglot Git hooks manager out there
brew "lefthook"

# Pager program similar to more
brew "less"

# Swiss-army Knife for macOS
brew "m-cli"

# Mac App Store CLI interface
brew "mas"

# CLI tool for saving complete web pages as a single HTML file
brew "monolith"

# Remote terminal application
brew "mosh"

# My TraceRoute
brew "mtr"

# An interactive cheatsheet tool for the CLI and application launchers
brew "navi"

# NCurses Disk Usage
brew "ncdu"

# command-line system information tool
brew "neofetch"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Network Kanji code conversion Filter (NKF)
brew "nkf"

# Node.js version manager
brew "nodebrew"

# Swiss-army knife of markup format conversion
brew "pandoc"

# CLI tool to generate, analyze, convert and manipulate colors
brew "pastel"

# procs is a replacement for ps
brew "procs"

# CLI task management tool for sequential and parallel execution
brew "pueue"

# Groom your app’s Ruby environment with rbenv
brew "rbenv"

# Search tool like grep and The Silver Searcher aka. rg
brew "ripgrep"

# rga: ripgrep, but also search in PDFs, E-Books, Office documents, zip, tar.gz, etc.
brew "ripgrep-all"

# Utility that provides fast incremental file transfer
brew "rsync"

# sd - s[earch] & d[isplace] like sed
brew "sd"

# Send macOS User Notifications from the CLI
brew "terminal-notifier"

# OCR (Optical Character Recognition) engine
brew "tesseract"

# A very fast implementation of tldr in Rust: Simplified, example based and community-driven man pages
brew "tealdeer"

# Programmatically correct mistyped console commands
brew "thefuck"

# Text interface for Git repositories
brew "tig"

# Keeping your system up to date mostly involves invoking more than a single package manager
brew "topgrade"

# CLI translator using Google Translate and more
brew "translate-shell"

# Source code beautifier
brew "uncrustify"

# Tool for watching a path and runs a command
brew "watchexec"

# Internet file retriever
brew "wget"

# Yubikey Manager
brew "ykman"

# In terminal graphical metrics for your *nix system written in Rust
brew "zenith"

# UNIX shell (command interpreter)
brew "zsh"

## Install Cask Packages
cask "1password"
cask "aerial"
cask "authy"
cask "appcleaner"
cask "docker"
cask "deepl"
cask "dropbox"
cask "evernote"
cask "font-genshingothic"
cask "font-hackgen-nerd"
cask "gitup"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "macwinzipper"
cask "popclip"
cask "raycast"
cask "suspicious-package"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "yubico-yubikey-manager"
