## Add Homebrew tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sanemat/font"

## Install Packages
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Pack, ship and run any application as a lightweight container
brew "docker"

# Modern replacement for 'ls'
brew "exa"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Play, record, convert, and stream audio and video
brew "ffmpeg"

# SSL/TLS cryptography library
brew "openssl"

# Infamous electronic fortune-cookie generator
brew "fortune"

# GitHub official CLI
brew "github/gh/gh"

# Remote repository management made easy
brew "ghq"

# Distributed revision control system
brew "git"

# Git extension for versioning large files
brew "git-lfs"

# Convert source code to formatted text with syntax highlighting
brew "highlight"

# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Swiss Army Knife for macOS
brew "m-cli"

# Mac App Store command-line interface
brew "mas"

# Remote terminal application
brew "mosh"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Network Kanji code conversion Filter (NKF)
brew "nkf"

# Node.js version manager
brew "nodebrew"

# Simplistic interactive filtering tool
brew "peco"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Send macOS User Notifications from the command-line
brew "terminal-notifier"

# Programmatically correct mistyped console commands
brew "thefuck"

# Text interface for Git repositories
brew "tig"

# Command-line translator using Google Translate and more
brew "translate-shell"

# Source code beautifier
brew "uncrustify"

# Internet file retriever
brew "wget"

# UNIX shell (command interpreter)
brew "zsh"

# Font for programming
brew "sanemat/font/ricty", args: ["with-powerline"]

## Install Cask Packages
cask "1password"
cask "adobe-creative-cloud"
cask "aerial"
cask "authy"
cask "appcleaner"
cask "docker"
cask "deepl"
cask "dropbox"
cask "edex-ui"
cask "evernote"
cask "font-genshingothic"
cask "gitup"
cask "glance"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "kite"
cask "launchbar"
cask "macwinzipper"
cask "popclip"
cask "pycharm"
cask "rectangle"
cask "suspicious-package"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
